## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sa.azurerm_storage_container.cont-insights-activity-logs will be created
  + resource "azurerm_storage_container" "cont-insights-activity-logs" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "insights-activity-logs"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "miszelauditlogne02"
    }

  # module.sa.azurerm_storage_container.cont-insights-operational-logs will be created
  + resource "azurerm_storage_container" "cont-insights-operational-logs" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "insights-operational-logs"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "miszelauditlogne02"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>